[
  {
    "title": "Technical Sales Support",
    "company": "Siemens Energy, Gurugram",
    "period": "Jul 2024 - Dec 2025",
    "points": [
      "Manage and deliver 7+ high-voltage substation tenders per month, ensuring technical and commercial compliance.",
      "Prepare proposals valued between $2M to $35M, tailored to diverse client requirements across regions.",
      "Coordinate with cross-functional teams, customers, and vendors to optimize bid quality, pricing strategy, and submission timelines."
    ]
  },
  {
    "title": "Intern",
    "company": "Siemens Energy, Aurangabad",
    "period": "Jul 2023 - Aug 2023",
    "points": [
      "Developed HMI for Gas Insulated Switchgear project; enhanced skills in UI design and PLC programming.",
      "Gained hands-on exposure to GIS systems vital in power transmission and industrial automation.",
      "Collaborated in innovative solution design for Siemens’ GIS department using industrial tools and technologies."
    ]
  },
  {
    "title": "Production Engineer Trainee",
    "company": "C&S Electric Ltd, Haridwar",
    "period": "Jun 2023 - Jul 2023",
    "points": [
      "Managed MCB (Miniature Circuit Breaker) plant operations; involved in spot welding and injection molding.",
      "Supervised production lines and contributed to quality control and assembly processes.",
      "Built expertise in circuit breaker components and manufacturing techniques."
    ]
  },
  {
    "title": "Chanakya UG Fellowship",
    "company": "iHub Divyasampark, Remote",
    "period": "Aug 2022 - May 2023",
    "points": [
      "Selected for a prestigious 10-month fellowship by Government of India and IIT Roorkee.",
      "Built IoT-based Smart Irrigation System to conserve water and improve agriculture efficiency.",
      "Managed end-to-end prototype development, stakeholder demos, and documentation."
    ]
  },
  {
    "title": "Engineer Trainee Intern",
    "company": "Siemens Mobility, Gurugram",
    "period": "Jun 2022 - Aug 2022",
    "points": [
      "Worked on Delhi Metro Rail Corporation projects related to signaling systems.",
      "Trained on ATP (Automatic Train Protection), ATO, ATC, Interlocking, and Train Control Management."
    ]
  },
  {
    "title": "Siemens Mechatronics Training",
    "company": "Siemens, Hybrid",
    "period": "Apr 2022 - Jan 2023",
    "points": [
      "Completed Basic and Advanced training in PLC, CNC, and electronics lab tools.",
      "Gained hands-on experience with FESTO, DIGIKIT, and TIA Portal V16.",
      "Trained in pneumatic systems, electrical schematics, troubleshooting, and 3D printing."
    ]
  },
  {
    "title": "Volunteer",
    "company": "HumanHood Organization",
    "period": "Jul 2018 - Present",
    "points": [
      "active volunteering work."
    ]
  },
  {
    "title": "Volunteer",
    "company": "BloodConnect Foundation",
    "period": "May 2022 - Oct 2022",
    "points": [
        "Volunteered for blood donation drives."
    ]
  },
  {
     "title": "Community Leader",
     "company": "Student Led Group",
     "period": "Jun 2020 - Apr 2021",
     "points": [
       "Founded a student-led group during COVID-19 to share verified information on oxygen, hospital beds, and medicines.",
       "Coordinated with volunteers and digital platforms for real-time data sharing.",
       "Assisted communities in accessing critical health resources."
     ]
  }
]
